In [1]:
import pandas as pd
import numpy as np

## Join - Index Match

In [2]:
izq = pd.DataFrame({'A': ['A0','A1','A2'],
  'B':['B0','B1','B2']},
  index=['k0','k1','k2'])

der =pd.DataFrame({'C': ['C0','C1','C2'],
  'D':['D0','D1','D2']},
  index=['k0','k2','k3'])

In [3]:
v

izq.join(der)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C1   D1

In [4]:
# Al hacer inner join solo mantuvo los indices que coinciden en ambos df

izq.join(der, how='inner')

     A   B   C   D
k0  A0  B0  C0  D0
k2  A2  B2  C1  D1

In [6]:
# Al realizar un right join nos mantuvo los índices del df de la derecha
# Como vemos, cuando hay un valor ausente lo completa con NaN
# Para este caso como el df izq no posee el índice k3, lo que hace
# es completar estos valores con NaN

izq.join(der, how='right')

      A    B   C   D
k0   A0   B0  C0  D0
k2   A2   B2  C1  D1
k3  NaN  NaN  C2  D2

In [8]:
# Un outer join nos trae todos los valores
# en este caso el outer se hace desde el df izq a der

izq.join(der, how='outer')

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1  NaN  NaN
k2   A2   B2   C1   D1
k3  NaN  NaN   C2   D2

In [9]:
# Un outer join nos trae todos los valores
# en este caso el outer se hace desde el df der a izq
# Podemos notar que el indice se mantiene en el mismo orden

der.join(izq, how='outer')

      C    D    A    B
k0   C0   D0   A0   B0
k1  NaN  NaN   A1   B1
k2   C1   D1   A2   B2
k3   C2   D2  NaN  NaN